DATE : 20/01/2026

## What is Pandas?

Pandas is a Python library used for data analysis and data manipulation.  
It helps us to store, clean, analyze, and process data in the form of tables (rows and columns), just like Excel sheets.

ðŸ‘‰ Pandas is mainly used in:

Data Science  
Machine Learning  
Data Analytics  
Python programming

#### Features of Pandas:  

1ï¸âƒ£ DataFrame and Series   

Series â†’ one-dimensional data (single column)  
DataFrame â†’ two-dimensional data (rows & columns)

2ï¸âƒ£ Easy Data Handling

Read data from CSV, Excel, JSON, SQL  
Write data back to files

3ï¸âƒ£ Fast and Efficient

Built on NumPy, so operations are very fast

4ï¸âƒ£ Data Cleaning

Handle missing values (NaN)  
Remove duplicate data  
Rename columns easily

5ï¸âƒ£ Data Filtering and Selection

Select rows and columns easily  
Apply conditions (marks > 60, age < 25)

6ï¸âƒ£ Powerful Data Analysis

Sorting  
Grouping  
Aggregation (sum, mean, max, min)

7ï¸âƒ£ Flexible Indexing

Label-based indexing  
Integer-based indexing

8ï¸âƒ£ Time Series Support

Useful for date and time data  
Used in finance and stock analysis

9ï¸âƒ£ Data Visualization Support

Works with Matplotlib and Seaborn  
Helps in plotting graphs and charts

ðŸ”Ÿ Easy Integration

Works well with NumPy, SciPy, Matplotlib  

#### NUMPY VS PANDAS

| Feature        | **Pandas**                                 | **NumPy**                                    |
| -------------- | ------------------------------------------ | -------------------------------------------- |
| Type           | Python library for **data analysis**       | Python library for **numerical computation** |
| Data Structure | **Series, DataFrame**                      | **ndarray (array)**                          |
| Data Type      | Can handle **mixed data types**            | Supports **same data type only**             |
| Dimensionality | 1D & 2D (mainly tables)                    | 1D, 2D, multi-dimensional                    |
| Missing Values | Handles **NaN easily**                     | Limited support for NaN                      |
| Indexing       | Label-based & integer-based                | Index-based only                             |
| Data Handling  | Best for **tabular data (rows & columns)** | Best for **mathematical calculations**       |
| Speed          | Slightly slower than NumPy                 | **Very fast**                                |
| File Handling  | Read/write CSV, Excel, SQL                 | No direct file handling                      |
| Use Case       | Data analysis, ML, reports                 | Scientific & numerical computing             |

### Primary Data Structures in Pandas

1ï¸âƒ£ Series

ðŸ‘‰ One-dimensional labeled array

ðŸ”¹ Meaning

A Series is like a single column of data with index labels.

ðŸ”¹ Features

- Stores homogeneous or mixed data  
- Has index + values  
- Similar to 1D array / column in Excel

ðŸ”¹ Real-life example

- Marks of students
- Temperature readings
- Prices of products

2ï¸âƒ£ DataFrame

ðŸ‘‰ Two-dimensional data structure (most used)

ðŸ”¹ Meaning

A DataFrame is like a table with rows and columns (similar to Excel / SQL table).

ðŸ”¹ Features

- Rows + Columns with labels
- Each column can have different data types
- Supports filtering, sorting, grouping

ðŸ”¹ Real-life example

- Student database
- Employee records
- Sales reports

In [1]:
import pandas as pd
pd.__version__

'2.3.3'

In [2]:
s=pd.Series([10,20,30,40,50])
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s.dtype

dtype('int64')

In [4]:
s.values

array([10, 20, 30, 40, 50])

In [5]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
s.name

In [7]:
s.name="numbers"

In [8]:
s

0    10
1    20
2    30
3    40
4    50
Name: numbers, dtype: int64

In [9]:
s.name

'numbers'

In [10]:
# indexing

s[0]

np.int64(10)

In [11]:
s[0:2]      #[start:stop:step]

0    10
1    20
Name: numbers, dtype: int64

In [12]:
s[2:4]

2    30
3    40
Name: numbers, dtype: int64

In [13]:
# iloc ->location based indexing

s.iloc[3]

np.int64(40)

In [14]:
s.iloc[[1,3,4]]

1    20
3    40
4    50
Name: numbers, dtype: int64

In [15]:
s.name="calories"

In [16]:
index=["apple","banana","grapes","orange","strawberry"]
s.index = index
print(s)

apple         10
banana        20
grapes        30
orange        40
strawberry    50
Name: calories, dtype: int64

In [17]:
s['grapes']

np.int64(30)

In [18]:
#loc -> label based indexing
s.loc['grapes']

np.int64(30)

In [19]:
# in label based indexing your start as well as stop value both are included in the output

s['banana':'orange']

banana    20
grapes    30
orange    40
Name: calories, dtype: int64

In [20]:
fruit_protein={
    "Avacado":2.0,       # grams of protein
    "Guava":2.6,
    "Blackberries":2.0,
    "Oranges":0.9,
    "Banana":1.1,
    "Apples":0.3,
    "Kiwi":1.1,
    "Pomegranate":1.7,
    "Mango":0.8,
    "Cherries":1.0
}

In [21]:
s2=pd.Series(fruit_protein,name="Protein")
s2

Avacado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [22]:
# Conditional Selection

print(s2>1)     # mask series
print("========================")
print(s2[s2>1])     # it shows only true using []

Avacado          True
Guava            True
Blackberries     True
Oranges         False
Banana           True
Apples          False
Kiwi             True
Pomegranate      True
Mango           False
Cherries        False
Name: Protein, dtype: bool
========================
Avacado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Name: Protein, dtype: float64

In [23]:
# logical operators and ,or,not

print(s2[(s2>0.5)&(s2<=2)])     # and
print("========================")

print(s2[(s2>0.5)|(s2<=2)])     # or
print("========================")

print(s2[~(s2>1)])          # not

Avacado         2.0
Blackberries    2.0
Oranges         0.9
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64
========================
Avacado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64
========================
Oranges     0.9
Apples      0.3
Mango       0.8
Cherries    1.0
Name: Protein, dtype: float64

In [24]:
# Modifying the series

s2["Mango"]=2.8
s2

Avacado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           2.8
Cherries        1.0
Name: Protein, dtype: float64

In [25]:
import numpy as np

In [26]:
# Dataframe:

data={
    "Name":["Vaishnavi","Sujata","Shrushti","Anvi","Dipali","Shravani"],
    "Age":[24,30,28,np.nan,31,26],
    "Department":["HR","IT","Finance","IT","HR","HR"],
    "Salary":[50000,60000,70000,62000,np.nan,50000]
}

In [27]:
data

{'Name': ['Vaishnavi', 'Sujata', 'Shrushti', 'Anvi', 'Dipali', 'Shravani'],
 'Age': [24, 30, 28, nan, 31, 26],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [28]:
df=pd.DataFrame(data)
df

        Name   Age Department   Salary
0  Vaishnavi  24.0         HR  50000.0
1     Sujata  30.0         IT  60000.0
2   Shrushti  28.0    Finance  70000.0
3       Anvi   NaN         IT  62000.0
4     Dipali  31.0         HR      NaN
5   Shravani  26.0         HR  50000.0

In [29]:
df.head(2)

        Name   Age Department   Salary
0  Vaishnavi  24.0         HR  50000.0
1     Sujata  30.0         IT  60000.0

In [30]:
df.tail(3)

       Name   Age Department   Salary
3      Anvi   NaN         IT  62000.0
4    Dipali  31.0         HR      NaN
5  Shravani  26.0         HR  50000.0

In [31]:
# loc and iloc

df.iloc[1:3, :2]        # [row_start:row_end, column_start:column_end]

       Name   Age
1    Sujata  30.0
2  Shrushti  28.0

In [32]:
df.loc[1:3,["Age","Department"]]

    Age Department
1  30.0         IT
2  28.0    Finance
3   NaN         IT

In [33]:
df[["Age","Department"]]

    Age Department
0  24.0         HR
1  30.0         IT
2  28.0    Finance
3   NaN         IT
4  31.0         HR
5  26.0         HR

In [34]:
df.drop("Age",axis=1,inplace=True)      # by default inplace false because of true it will affect original data

In [35]:
df

        Name Department   Salary
0  Vaishnavi         HR  50000.0
1     Sujata         IT  60000.0
2   Shrushti    Finance  70000.0
3       Anvi         IT  62000.0
4     Dipali         HR      NaN
5   Shravani         HR  50000.0

In [36]:
df.shape

(6, 3)

In [37]:
# adding column age

df['Age']=[23,35,24,np.nan,30,28]

In [38]:
df

        Name Department   Salary   Age
0  Vaishnavi         HR  50000.0  23.0
1     Sujata         IT  60000.0  35.0
2   Shrushti    Finance  70000.0  24.0
3       Anvi         IT  62000.0   NaN
4     Dipali         HR      NaN  30.0
5   Shravani         HR  50000.0  28.0

In [39]:
df.shape

(6, 4)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Department  6 non-null      object
 2   Salary      5 non-null      float64
 3   Age         5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [41]:
df.describe()

             Salary       Age
count      5.000000   5.00000
mean   58400.000000  28.00000
std     8532.291603   4.84768
min    50000.000000  23.00000
25%    50000.000000  24.00000
50%    60000.000000  28.00000
75%    62000.000000  30.00000
max    70000.000000  35.00000

In [42]:
# Broadcasting

df["Salary"] = df["Salary"]+5000

In [43]:
df["Salary"]

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [44]:
# Renaming the columns

df.rename(columns={"Department":"Dept"},inplace=True)

In [45]:
df

        Name     Dept   Salary   Age
0  Vaishnavi       HR  55000.0  23.0
1     Sujata       IT  65000.0  35.0
2   Shrushti  Finance  75000.0  24.0
3       Anvi       IT  67000.0   NaN
4     Dipali       HR      NaN  30.0
5   Shravani       HR  55000.0  28.0

In [46]:
print(df["Salary"].unique())
print(df["Dept"].unique())

[55000. 65000. 75000. 67000.    nan]
['HR' 'IT' 'Finance']

In [47]:
df["Dept"].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [48]:
df["Promoted Salary"]=df["Salary"]*10

In [49]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
3       Anvi       IT  67000.0   NaN         670000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  28.0         550000.0

In [50]:
# Data Cleaning

df.isnull().sum()

Name               0
Dept               0
Salary             1
Age                1
Promoted Salary    1
dtype: int64

In [51]:
df.dropna()

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
5   Shravani       HR  55000.0  28.0         550000.0

In [52]:
df.dropna(how="any")        # any row that had any null value

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
5   Shravani       HR  55000.0  28.0         550000.0

In [53]:
df.dropna(how="all")        # if all the values in any row are null then we drop that row

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
3       Anvi       IT  67000.0   NaN         670000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  28.0         550000.0

In [54]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
3       Anvi       IT  67000.0   NaN         670000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  28.0         550000.0

In [55]:
df.fillna(0)

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
3       Anvi       IT  67000.0   0.0         670000.0
4     Dipali       HR      0.0  30.0              0.0
5   Shravani       HR  55000.0  28.0         550000.0

In [56]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
3       Anvi       IT  67000.0   NaN         670000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  28.0         550000.0

In [57]:
df["Age"].fillna(df["Age"].mean)

0                                                 23.0
1                                                 35.0
2                                                 24.0
3    <bound method Series.mean of 0    23.0\n1    3...
4                                                 30.0
5                                                 28.0
Name: Age, dtype: object

In [58]:
df["Salary"].fillna(df["Salary"].median)

0                                              55000.0
1                                              65000.0
2                                              75000.0
3                                              67000.0
4    <bound method Series.median of 0    55000.0\n1...
5                                              55000.0
Name: Salary, dtype: object

In [59]:
df["Age"].fillna(method="ffill")

C:\Users\Vaishnavi Giri\AppData\Local\Temp\ipykernel_16648\310954073.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method="ffill")

0    23.0
1    35.0
2    24.0
3    24.0
4    30.0
5    28.0
Name: Age, dtype: float64

In [60]:
df["Age"].fillna(method="bfill")

C:\Users\Vaishnavi Giri\AppData\Local\Temp\ipykernel_16648\3345892411.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method="bfill")

0    23.0
1    35.0
2    24.0
3    30.0
4    30.0
5    28.0
Name: Age, dtype: float64

In [61]:
df["Name"]= df["Name"].replace("Vaishu","Shravani")
df["Age"]= df["Age"].replace(28,23)

In [62]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
3       Anvi       IT  67000.0   NaN         670000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  23.0         550000.0

In [63]:
# Dupliates:

df_dup=df[df.duplicated(keep="last")]
df_dup

Empty DataFrame
Columns: [Name, Dept, Salary, Age, Promoted Salary]
Index: []

In [64]:
df=df.drop_duplicates()

In [65]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0         550000.0
1     Sujata       IT  65000.0  35.0         650000.0
2   Shrushti  Finance  75000.0  24.0         750000.0
3       Anvi       IT  67000.0   NaN         670000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  23.0         550000.0

In [66]:
# invalid values

df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x: x/10 if x>65000 else x)

In [67]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0          55000.0
1     Sujata       IT  65000.0  35.0          65000.0
2   Shrushti  Finance  75000.0  24.0          75000.0
3       Anvi       IT  67000.0   NaN          67000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  23.0          55000.0

In [68]:
# name="Vaishnavi_Giri"
# df[["first_name","last_name"]]=df["name"].str.split("_")

In [69]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0          55000.0
1     Sujata       IT  65000.0  35.0          65000.0
2   Shrushti  Finance  75000.0  24.0          75000.0
3       Anvi       IT  67000.0   NaN          67000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  23.0          55000.0

In [70]:
# apply and lambda

def multiplying_age(x):
    return x*2

df["Age"]=df["Age"].apply(multiplying_age)

In [71]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  46.0          55000.0
1     Sujata       IT  65000.0  70.0          65000.0
2   Shrushti  Finance  75000.0  48.0          75000.0
3       Anvi       IT  67000.0   NaN          67000.0
4     Dipali       HR      NaN  60.0              NaN
5   Shravani       HR  55000.0  46.0          55000.0

In [72]:
df["Age"]=df["Age"].apply(lambda x: x/2)

In [73]:
df

        Name     Dept   Salary   Age  Promoted Salary
0  Vaishnavi       HR  55000.0  23.0          55000.0
1     Sujata       IT  65000.0  35.0          65000.0
2   Shrushti  Finance  75000.0  24.0          75000.0
3       Anvi       IT  67000.0   NaN          67000.0
4     Dipali       HR      NaN  30.0              NaN
5   Shravani       HR  55000.0  23.0          55000.0

In [74]:
# Joins and Merges

department_info ={
    "Department": ["HR", "IT", "Finance"], 
    "Location":["New York", "San Francisco", "Chicago"], 
    "Manager":["Laura", "Steve", "Nina"]
}

df2=pd.DataFrame(department_info)
df2

  Department       Location Manager
0         HR       New York   Laura
1         IT  San Francisco   Steve
2    Finance        Chicago    Nina

In [75]:
# concat

pd.concat([df,df2])

,Name,Dept,Salary,Age,Promoted Salary,Department,Location,Manager
0,Vaishnavi,HR,55000.0,23.0,55000.0,NaN,NaN,NaN
1,Sujata,IT,65000.0,35.0,65000.0,NaN,NaN,NaN
2,Shrushti,Finance,75000.0,24.0,75000.0,NaN,NaN,NaN
3,Anvi,IT,67000.0,NaN,67000.0,NaN,NaN,NaN
4,Dipali,HR,NaN,30.0,NaN,NaN,NaN,NaN
5,Shravani,HR,55000.0,23.0,55000.0,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,HR,New York,Laura
1,NaN,NaN,NaN,NaN,NaN,IT,San Francisco,Steve
2,NaN,NaN,NaN,NaN,NaN,Finance,Chicago,Nina

In [76]:
pd.concat([df,df2],axis=1)

,Name,Dept,Salary,Age,Promoted Salary,Department,Location,Manager
0,Vaishnavi,HR,55000.0,23.0,55000.0,HR,New York,Laura
1,Sujata,IT,65000.0,35.0,65000.0,IT,San Francisco,Steve
2,Shrushti,Finance,75000.0,24.0,75000.0,Finance,Chicago,Nina
3,Anvi,IT,67000.0,NaN,67000.0,NaN,NaN,NaN
4,Dipali,HR,NaN,30.0,NaN,NaN,NaN,NaN
5,Shravani,HR,55000.0,23.0,55000.0,NaN,NaN,NaN

In [77]:
pd.merge(df,df2, on="Dept")

KeyError: 'Dept'

In [ ]:
# Importing File

data=pd.read_csv("data.csv")

In [ ]:
data.head()

Empty DataFrame
Columns: [enrollment no, name, UT1, UT2]
Index: []

In [ ]:
data.shape

(0, 4)

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   enrollment no  0 non-null      object
 1   name           0 non-null      object
 2   UT1            0 non-null      object
 3   UT2            0 non-null      object
dtypes: object(4)
memory usage: 132.0+ bytes

In [ ]:
data['enrollment no']=pd.to_datetime(data['enrollment no'])

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   enrollment no  0 non-null      datetime64[ns]
 1   name           0 non-null      object
 2   UT1            0 non-null      object
 3   UT2            0 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 132.0+ bytes